Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Physical input from the user as well as artificial input generated by any program or script (such as the Send or MouseMove functions) will reset this value back to zero.
ja: ユーザーからの物理的な入力や、何等かのプログラムやスクリプト（Send関数やMouseMove関数など）によって生成された人工的な入力は、この値をゼロに戻す。

source: Picture (or Pic)
ja: Picture（またはPic）

source: Picture Control Styles
ja: Pictureコントロールのスタイル

source: Picture controls no longer delete their current image when they fail to set a new image via GuiCtrl.Value := "new image.png".
ja: GuiCtrl.Value := "new image.png"で新しい画像の設定に失敗しても、ピクチャーコントロールが現在の画像を削除しないようになりました。

source: Pictures
ja: ピクチャ

source: PixelGetColor - Syntax & Usage | AutoHotkey v2
ja: PixelGetColor - 構文と使用法｜AutoHotkey v2

source: PixelGetColor might not produce accurate results for certain applications.
ja: PixelGetColorは、アプリケーションによっては正確な結果が得られない場合があります。

source: PixelSearch - Syntax & Usage | AutoHotkey v2
ja: PixelSearch - 構文と使用法｜AutoHotkey v2

source: PixelSearch returns 1 (true) if the color was found.
ja: PixelSearchは、その色が見つかった場合、1 (true)を返します。

source: PixelSearch returns true if the color was found.
ja: PixelSearchは、その色が見つかった場合、trueを返します。

source: PixelSearch's slow mode was removed, as it is unusable on most modern systems due to an incompatibility with desktop composition.
ja: PixelSearchのスローモードは、デスクトップコンポジションとの非互換性により、ほとんどの最新システムで使用できないため、削除されました。

source: Places a message in the message queue of a window or control.
ja: ウィンドウまたはコントロールのメッセージキューにメッセージを配置します。

source: Places text at the top of the control's available height.
ja: コントロールの使用可能な高さの上端にテキストを配置する。

source: Places the text at the bottom of the control's available height.
ja: コントロールの使用可能な高さの下端にテキストを配置する。

source: Places tooltips at absolute screen coordinates.
ja: ツールチップを絶対的な画面座標に配置します。

source: Placing library scripts in one of these locations makes it easier to write scripts that can be shared with others and work across multiple setups.
ja: ライブラリスクリプトをこれらの場所のいずれかに置くと、他の人と共有でき、複数のセットアップで動作するスクリプトを簡単に書くことができます。

source: Plain words in expressions are interpreted as variable names.
ja: 式中のプレーンワードは変数名として解釈されます。

source: Play/Pause
ja: 再生/一時停止

source: Play/pause media player
ja: メディアプレーヤーの再生/一時停止

source: Plays a .wav file located in the Windows directory.
ja: Windowsディレクトリにある.wavファイルを再生する。

source: Plays a higher pitch for half a second.
ja: 半秒間、より高いピッチを再生する。

source: Plays a sound, video, or other supported file type.
ja: サウンドやビデオなど、対応するファイル形式を再生します。

source: Plays the default pitch and duration.
ja: デフォルトのピッチとデュレーションで演奏する。

source: Please note that hexadecimal numbers must have an 0x prefix.
ja: 16進数には0xのプレフィックスが必要です。

source: Please note that you cannot IGNORE parameters, but you can leave them blank.
ja: パラメータを無視することはできませんが、空白にすることはできます。

source: Please pay attention to the colon equal sign (:=).
ja: コロンの等号（:=）に注意してください。

source: Please post changes and improvements in the forum or contact the author.
ja: 変更や改良はフォーラムに投稿するか、作者に連絡してください。

source: Pointer Size
ja: ポインタサイズ

source: Pointer types permit either a pure integer address as before, or an object/ComValue.
ja: ポインタ型は、従来通り純粋な整数アドレスか、オブジェクト/ComValueのいずれかを許可します。

source: Pointers are 4 bytes in 32-bit builds and 8 bytes in 64-bit builds.
ja: ポインターは32ビットビルドでは4バイト、64ビットビルドでは8バイトです。

source: Pointers to Objects
ja: オブジェクトへのポインタ

source: Pop method
ja: Popメソッド

source: Portability of AutoHotkey.exe
ja: AutoHotkey.exeの移植性

source: Pos, Len and Name are now properties and methods.
ja: Pos、Len、Nameがプロパティとメソッドになりました。

source: Position -1 is the last character and position 0 is invalid (whereas in v1, position 0 was the last character).
ja: 位置-1が最後の文字で、位置0は無効です（v1では位置0が最後の文字でしたが）。

source: Position 0 is the leftmost column of pixels visible on the screen.
ja: ポジション0は、画面上で見えるピクセルの一番左の列です。

source: Position 0 is the topmost row of pixels visible on the screen.
ja: ポジション0は、画面上で見える一番上の画素列です。

source: Position 1 is the first character.
ja: ポジション1が最初の文字です。

source: Position 1 is the first character; this is because 0 is synonymous with "false", making it an intuitive "not found" indicator.
ja: これは、0が「偽」と同義であり、直感的に「見つからない」ことを示すからである。

source: Position 1& is the first menu item (e.g. the File menu), position 2& is the second menu item (e.g. the Edit menu), and so on.
ja: ポジション1&は1番目のメニュー項目（例：ファイルメニュー）、ポジション2&は2番目のメニュー項目（例：編集メニュー）、といった具合に。

source: Positioning and Sizing of Controls
ja: コントロールの位置づけとサイズ

source: Positions UpDown on the left side of its buddy control.
ja: UpDownをバディコントロールの左側に配置する。

source: Positions UpDown on the right side of its buddy control.
ja: UpDownをバディコントロールの右側に配置する。

source: Positions a checkbox square or radio button circle on the right side of the control's available width instead of the left.
ja: チェックボックスの四角やラジオボタンの丸を、コントロールの使用可能幅の左側ではなく右側に配置する。

source: Possible values are 0 (disabled) and 1 (enabled).
ja: 設定可能な値は0（無効）または1（有効）。

source: Possible values are 0 (forbidden) and 1 (allowed).
ja: 設定可能な値は0（禁止）と1（許可）。

source: Possible values are 0 (visible) and 1 (hidden).
ja: 設定可能な値は0（可視）または1（非表示）。

source: Possible values are 1, 2, 3 and RegEx.
ja: 設定可能な値は1、2、3、RegEx。

source: Possible values are 1, 2, 3, and RegEx.
ja: 設定可能な値は1、2、3、RegEx。

source: Possible values are 32, 64 and Default.
ja: 設定可能な値は32、64、Default。

source: Possible values are Event, Input, Play and InputThenPlay.
ja: 取り得る値は、Event、Input、Play、InputThenPlay。

source: Possible values are Event, Input, Play, and InputThenPlay.
ja: 取り得る値は、Event、Input、Play、InputThenPlay。

source: Possible values are Fast and Slow.
ja: 設定可能な値はFastとSlow。

source: Possible values are Screen, Window and Client.
ja: 設定可能な値は Screen、Window、Client です。

source: Possible values are Screen, Window, and Client.
ja: 設定可能な値は Screen、Window、Client です。

source: Post anything you have tried.
ja: 試したことがあれば何でも投稿してください。

source: PostMessage - Syntax & Usage | AutoHotkey v2
ja: PostMessage - 構文と使用法｜AutoHotkey v2

source: PostMessage / SendMessage Tutorial by Rajat
ja: PostMessage / SendMessage チュートリアルby Rajat

source: PostMessage / SendMessage Tutorial | AutoHotkey v2
ja: PostMessage / SendMessage チュートリアル｜AutoHotkey v2

source: PostMessage 0x0050, 0, 0x4090409,, "A" ; 0x0050 is WM_INPUTLANGCHANGEREQUEST.
ja: PostMessage 0x0050, 0, 0x4090409,, "A" ; 0x0050はWM_INPUTLANGCHANGEREQUESTです。

source: PostMessage 0x0111, 639,,, "Untitled - Paint"
ja: ポストメッセージ 0x0111, 639,,, "無題 - ペイント"

source: PostMessage 0x0111, 65303,,, "ScriptFileName.ahk - AutoHotkey" ; Reload.
ja: PostMessage 0x0111, 65303,,, "ScriptFileName.ahk - AutoHotkey" ; リロード

source: PostMessage 0x0111, 65305,,, "ScriptFileName.ahk - AutoHotkey" ; Suspend.
ja: PostMessage 0x0111, 65305,,, "ScriptFileName.ahk - AutoHotkey" ; サスペンド

source: PostMessage 0x0111, 65306,,, "ScriptFileName.ahk - AutoHotkey" ; Pause.
ja: PostMessage 0x0111, 65306,,, "ScriptFileName.ahk - AutoHotkey" ; ボーズ

source: PostMessage 0x0185, 0, -1, ListBox ; Deselect all items.
ja: PostMessage 0x0185, 0, -1, ListBox ; すべてのアイテムの選択を解除します。

source: PostMessage 0x0185, 1, -1, ListBox ; Select all items. 0x0185 is LB_SETSEL.
ja: PostMessage 0x0185, 1, -1, ListBox ; 全項目を選択。0x0185はLB_SETSELです。

source: PostMessage places the message in the message queue associated with the target window and does not wait for acknowledgement or reply.
ja: PostMessageは、ターゲットウィンドウに関連付けられたメッセージキューにメッセージを配置し、受信確認または応答することをを待ちません。

source: PostMessage places the message in the message queue associated with the target window.
ja: PostMessageは、ターゲットウィンドウに関連するメッセージキューにメッセージを配置します。

source: Posted messages also might not be buffered when a modal message loop is running, such as for a system dialog, ListView drag-drop operation or menu.
ja: システムダイアログ、リストビューのドラッグ＆ドロップ操作、メニューなどのモーダルメッセージループが実行されている場合、投稿されたメッセージがバッファされない場合があります。

source: Pre-Release
ja: プレリリース

source: Pre-loads and reuses some images.
ja: 一部の画像をプリロードして再利用します。

source: Pre-release versions are considered lower than standard releases.
ja: 発売前のバージョンは、標準的なリリースより低いとみなされます。

source: Preamble
ja: 前文

source: Precise definition of A_YWeek:
ja: A_YWeekの正確な定義：

source: Precise definition of A_YWeek: If the week containing January 1st has four or more days in the new year, it is considered week 1.
ja: A_YWeekの正確な定義：新年1月1日を含む週が4日以上ある場合は、第1週とします。

source: Preemptive message checks, which potentially occur before each line of code executes.
ja: プリエンプティブメッセージチェック（各コード行の実行前に発生する可能性がある。

source: Prefix
ja: 接頭辞

source: Prefix operator used on the wrong side or lacking an operand; e.g. x!
ja: 間違った側で使用された、またはオペランドを欠いているプリフィックス演算子（例：x!）

source: Prefix the combination with tilde (~), as in ~Numpad0 & Numpad1::.
ja: ~Numpad0 & Numpad1::のように、組み合わせの前にチルダ（~）を付けます。

source: Prepend the letter U to any of the integer types above to interpret it as an unsigned integer (UInt64, UInt, UShort, and UChar).
ja: 上記の整数型の前にUを付けると、符号なし整数（UInt64、UInt、UShort、UChar）として解釈されます。

source: Press
ja: プレス

source: Press Alt+PrtSc while the image is visible in the active window.
ja: アクティブウィンドウに画像が表示されている状態で、 Alt+PrtScを押します。

source: Press Shift+Esc to show the command line which was used to launch the active window's process.
ja: Shift+Escキーを押すと、アクティブウィンドウのプロセスを起動するために使用されたコマンドラインが表示されます。

source: Press Win+R to open the Run dialog, then enter shell:startup and click OK or Enter.
ja: Win+Rを押して「ファイル名を指定して実行」ダイアログを開き、「shell:startup」と入力して「OK」または「Enter」をクリックします。

source: Press Apply.
ja: 適用を押す。

source: Press ESCAPE to cancel, or double-click a new
ja: ESCAPEキーを押してキャンセルするか、ダブルクリックで新しい

source: Press OK.
ja: OKを押す。

source: Press a hotkey once to pause the script.
ja: ホットキーを1回押すと、スクリプトを一時停止することができます。

source: Press a hotkey once to suspend all hotkeys and hotstrings.
ja: ホットキーを1回押すと、すべてのホットキーとホットストリングが一時停止します。

source: Press a hotkey to change the priority of the active window's process.
ja: ホットキーを押して、アクティブウィンドウのプロセスの優先順位を変更することができます。

source: Press a hotkey to display a tooltip for 3 seconds.
ja: ホットキーを押すと、ツールチップを3秒間表示します。

source: Press a hotkey to maximize the active window.
ja: ホットキーを押してアクティブウィンドウを最大化する。

source: Press a hotkey to minimize the active window.
ja: ホットキーを押してアクティブウィンドウを最小化する。

source: Press a hotkey to restart the script.
ja: ホットキーを押してスクリプトを再起動します。

source: Press a hotkey to show the color of the pixel located at the current position of the mouse cursor.
ja: ホットキーを押すと、マウスカーソルの現在位置にある画素の色が表示されます。

source: Press a hotkey to temporarily reduce the mouse cursor's speed, which facilitates precise positioning.
ja: ホットキーを押すと、マウスカーソルの速度が一時的に低下し、正確な位置決めがしやすくなります。

source: Press a hotkey to terminate the script.
ja: ホットキーを押してスクリプトを終了させる。

source: Press a hotkey to traverse all open MSIE windows.
ja: ホットキーを押すと、開いているすべてのMSIEウィンドウを縦断することができます。

source: Press a hotkey to visit all open browser windows in order from oldest to newest.
ja: ホットキーを押すと、開いているすべてのブラウザウィンドウを古いものから新しいものへと順番に表示します。

source: Press a hotkey to visit each MS Outlook 2002 window, one at a time.
ja: ホットキーを押して、MS Outlook 2002の各ウィンドウを1つずつ訪問します。

source: Press button:
ja: ボタンを押す：

source: Press it again to unpause.
ja: もう一度押すと、一時停止が解除されます。

source: Press it again to unsuspend.
ja: もう一度押すとサスペンドが解除される。

source: Press one of the "mystery keys" on your keyboard.
ja: キーボードの「何れかのキー」を押します。

source: Press the 'filter all' button and then dbl click 'wm_command' on the list on left.
ja: 'filter all'ボタンを押して、左のリストにある'wm_command'をダブルクリックする。

source: Press the Add button and select "Program".
ja: 追加ボタンを押し、「プログラム」を選択します。

source: Press the mouse button down but do not release it (i.e. generate a down-event).
ja: マウスボタンを押しながら離さない（ダウンイベントを発生させる）。

source: Presses down the left mouse button and holds it.
ja: マウスの左ボタンを押し下げ、そのまま保持します。

source: Pressing Ctrl+Alt+S would cause the system to behave as though you pressed Ctrl+Alt+Del (due to the system's aggressive detection of this hotkey).
ja: Ctrl+Alt+Sを押すと、Ctrl+Alt+Delを押したかのように動作します（このホットキーをシステムが積極的に検知するため）。

source: Pressing Ctrl+C while a message box is active will copy its text to the clipboard.
ja: メッセージボックスがアクティブな状態でCtrl+Cを押すと、そのテキストがクリップボードにコピーされます。

source: Pressing Tab changes the keyboard focus to the next control with the WS_TABSTOP style.
ja: Tabキーを押すと、次の WS_TABSTOP スタイルのコントロールにフォーカスが移ります。

source: Pressing Enter may then activate the default button even though it is not highlighted.
ja: Enterキーを押すと、ハイライトされていなくてもデフォルトのボタンが有効になることがあります。

source: Pressing Enter will activate the Create button, which creates the script and selects it in Explorer.
ja: Enterを押すとCreateボタンがアクティブになり、スクリプトが作成されてエクスプローラで選択されます。

source: Pressing Enter will activate the Edit button, which creates the script and opens it in the default script editor.
ja: Enterを押すとEditボタンが有効になり、スクリプトが作成されてデフォルトのスクリプトエディタで開きます。

source: Pressing a dead key might also cause the following key to produce text (if only the dead key's character).
ja: デッドキーを押すと、次のキーでも文字が出るかもしれません（デッドキーの文字だけなら）。

source: Pressing a hook hotkey causes the next Alt or Win keyup to be masked if all of the following conditions are met:
ja: フックホットキーを押すと、次のAltまたはWinのキーアップがマスクされるのは、以下の条件をすべて満たしている場合です：

source: Pressing the same hotkey again will stop it.
ja: 同じホットキーをもう一度押すと停止します。

source: Pretend everyone but you is a doorknob and knows nothing.
ja: 自分以外はドアノブで何も知らないふりをする。

source: Prevent the script from exiting automatically.
ja: スクリプトが自動的に終了しないようにします。

source: Prevents a user's click on this column from having any automatic sorting effect.
ja: このカラムをユーザーがクリックしても、自動的にソートされないようにします。

source: Prevents interpretation of any ampersand (&) characters in the control's text as accelerator prefix characters.
ja: コントロールのテキストに含まれるアンパサンド（&）文字を、アクセラレータのプレフィックス文字として解釈しないようにする。

source: Prevents interruptions from any timers.
ja: あらゆるタイマーからの割り込みを防ぐ。

source: Prevents mouse clicks from resetting the hotstring recognizer as described here.
ja: マウスクリックによるホットストリング認識機能のリセットをここで防止します。

source: Prevents the current thread from being interrupted by other threads, or enables it to be interrupted.
ja: 現在のスレッドが他のスレッドによって中断されるのを防ぐ、または中断されるのを可能にします。

source: Prevents the circling of today's date within the control.
ja: コントロール内で今日の日付が丸で囲まれるのを防ぐ。

source: Prevents the display of today's date at the bottom of the control.
ja: コントロールの下部に今日の日付が表示されないようにする。

source: Prevents the eject feature of the specified drive from working.
ja: 指定したドライブのイジェクト機能が動作しないようにします。

source: Prevents the key from being suppressed (blocked).
ja: キーが抑制される（ブロックされる）のを防ぐ。

source: Prevents the script from exiting automatically when its last thread completes, allowing it to stay running in an idle state.
ja: 最後のスレッドが完了したときにスクリプトが自動的に終了するのを防ぎ、アイドル状態で実行し続けることができるようにします。

source: Prevents the tree-view control from sending TVN_BEGINDRAG notification messages.
ja: ツリービューコントロールがTVN_BEGINDRAG通知メッセージを送信しないようにします。

source: Prevents the user from typing anything other than digits in the control.
ja: ユーザーがコントロール内に数字以外のものを入力できないようにする。

source: Prevents the user from typing or editing text in the edit control.
ja: ユーザーがエディットコントロールでテキストを入力または編集できないようにする。

source: Previous Track
ja: 前のトラック

source: Previous instances of the script are identified by searching for a main window with the default title.
ja: スクリプトの以前のインスタンスは、デフォルトのタイトルを持つメインウィンドウを検索することで識別されます。

source: Previous instances of the script are identified by the same mechanism as for #SingleInstance, with the same limitations.
ja: 以前のスクリプトのインスタンスは、#SingleInstanceと同じメカニズムで識別され、同じ制限があります。

source: Previously a string was passed by address if the expression began with ", but other strings were coerced to integers.
ja: 以前は、"で始まる式であればアドレスで文字列が渡されましたが、それ以外の文字列は整数に強制されていました。

source: Previously any cases with an invalid name would silently produce an empty string, while other cases would create and return an empty variable.
ja: 以前は、無効な名前を持つケースは黙って空文字列を生成し、その他のケースは空の変数を生成して返していました。

source: Previously if used in an expression within a command's parameter and not within parentheses, it forced the comma to be interpreted as the multi-statement operator rather than as a delimiter between parameters.
ja: 以前は、コマンドのパラメータ内の式で、括弧内ではなくカンマを使用すると、パラメータ間の区切り文字としてではなく、マルチステートメント演算子として解釈されるようになっていました。

source: Previously it returned the path of the compiled script if a BIN file was used as the base file, but v2.0 releases no longer include BIN files.
ja: 以前は、ベースファイルとしてBINファイルを使用した場合、コンパイルされたスクリプトのパスを返していましたが、v2.0リリースではBINファイルを含まないようになりました。

source: Previously it was case-sensitive only if StringCaseSense was changed to On.
ja: 以前はStringCaseSenseがOnに変更された場合のみ大文字と小文字を区別していました。

source: Previously it was left undefined, which meant that assignments such as A_IsCompiled := 1 were valid if the script hadn't been compiled.
ja: 以前は未定義のままだったため、スクリプトがコンパイルされていなくても、A_IsCompiled := 1のような代入が有効でした。

source: Previously the results were inconsistent between negative floats and negative integers.
ja: 以前は、負の浮動小数点と負の整数で結果が矛盾していました。

source: Previously they behaved as follows:
ja: 以前は以下のように振る舞っていました：

source: Previously they compared numerically or alphabetically depending on whether both inputs were numeric, but literal quoted strings were always considered non-numeric.
ja: 従来は、入力が数値かアルファベットかによって比較されていましたが、リテラル引用文字列は常に非数値とみなされていました。

source: Previously this required catching thrown values of all types, then checking type and re-throwing.
ja: これまでは、すべての型のスローされた値をキャッチし、型をチェックして再スローする必要がありました。

source: Previously, there were differences in behaviour when an error occurred within the expression or a blank value was used in a math operation.
ja: 従来は、式内でエラーが発生した場合や、数学演算で空白の値が使用された場合に、動作に違いがありました。

source: Previously:
ja: 以前：

source: Primary mouse button.
ja: マウスの第1ボタン。

source: Primitive Values
ja: プリミティブ値

source: Primitive and Object extend Any.
ja: PrimitiveとObjectはAnyを拡張します。

source: Primitive values emulate objects by delegating method and property calls to a prototype object based on their type, instead of the v1 "default base object".
ja: プリミティブ値は、v1の「デフォルトのベースオブジェクト」の代わりに、メソッドやプロパティの呼び出しをその型に応じたプロトタイプオブジェクトに委ねることで、オブジェクトを模倣します。

source: Primitive values, such as strings and numbers, cannot have their own properties and methods.
ja: 文字列や数値などのプリミティブ値は、独自のプロパティやメソッドを持つことはできない。

source: Prints the indicated file with the associated application, if any.
ja: 指定されたファイルを、もしあれば、関連するアプリケーションとともに印刷します。

source: Prioritising the error type over the output variable name might encourage better code; handling the expected error as intended without suppressing or mishandling unexpected errors that should have been reported.
ja: 出力変数名よりもエラーの種類を優先することで、より良いコードを作ることができるかもしれません。期待されるエラーを意図通りに処理し、報告されるべき予期せぬエラーを抑制したり誤処理したりすることはありません。

source: Problems?
ja: 問題点は？

source: Process Functions
ja: Process関数

source: Process ID
ja: プロセスID

source: Process ID (PID)
ja: プロセスID(PID)

source: Process Name/Path
ja: プロセス名/パス

source: Process functions
ja: Process関数

source: ProcessClose - Syntax & Usage | AutoHotkey v2
ja: ProcessClose - 構文と使用法｜AutoHotkey v2

source: ProcessExist - Syntax & Usage | AutoHotkey v2
ja: ProcessExist - 構文と使用法｜AutoHotkey v2

source: ProcessGetName / ProcessGetPath - Syntax & Usage | AutoHotkey v2
ja: ProcessGetName / ProcessGetPath - 構文と使用法｜AutoHotkey v2

source: ProcessGetName returns the name of the specified process.
ja: ProcessGetName は、指定されたプロセスの名前を返します。

source: ProcessGetParent - Syntax & Usage | AutoHotkey v2
ja: ProcessGetParent - 構文と使用法｜AutoHotkey v2

source: ProcessGetPath returns the path of the specified process.
ja: ProcessGetPath は、指定されたプロセスのパスを返します。

source: ProcessSetPriority - Syntax & Usage | AutoHotkey v2
ja: ProcessSetPriority - 構文と使用法｜AutoHotkey v2

source: ProcessWait - Syntax & Usage | AutoHotkey v2
ja: ProcessWait - 構文と使用法｜AutoHotkey v2

source: ProcessWaitClose - Syntax & Usage | AutoHotkey v2
ja: ProcessWaitClose - 構文と使用法｜AutoHotkey v2

source: Processes are checked every 100 milliseconds; the moment the condition is satisfied, the function stops waiting.
ja: プロセスは100ミリ秒ごとにチェックされ、条件が満たされた瞬間に関数は待機を停止します。

source: ProgramFiles (use A_ProgramFiles)
ja: ProgramFiles（A_ProgramFilesを使用します）

source: Programs are launched by calling the Run function, passing the command line of the program as a parameter:
ja: プログラムの起動は、Run関数を呼び出して、プログラムのコマンドラインをパラメータとして渡すことで行います：

source: Progress (use Gui)
ja: Progress （Guiを使用）

source: Progress Control Styles
ja: Progressコントロールのスタイル

source: Progress Gui controls no longer have the PBS_SMOOTH style by default, so they are now styled according to the system visual style.
ja: Progress Guiコントロールは、デフォルトでPBS_SMOOTHスタイルを持たなくなり、システムのビジュアルスタイルに従ってスタイリングされるようになりました。

source: Prompt to Create New File
ja: 新規ファイル作成時のプロンプト

source: Prompt to Overwrite File
ja: ファイルを上書きするプロンプト

source: Prompts the user to copy a folder.
ja: フォルダーをコピーするよう促す。

source: Properties
ja: プロパティ

source: Properties and Methods
ja: プロパティとメソッド

source: Properties and methods (callable properties) can generally be added to new objects at any time.
ja: プロパティとメソッド（呼び出し可能なプロパティ）は通常、いつでも新しいオブジェクトに追加できる。

source: Properties and methods are inherited from the base object dynamically, so changing an object's base also changes which inherited properties and methods are available.
ja: プロパティやメソッドはベースオブジェクトから動的に継承されるため、オブジェクトのベースを変更すると、継承されたプロパティやメソッドを利用できるものも変更されます。

source: Properties and methods can be added for all values of a given type by modifying that type's prototype object.
ja: プロパティとメソッドは、その型のプロトタイプ・オブジェクトを修正することによって、与えられた型のすべての値に対して追加することができる。

source: Properties and methods can be defined for objects of type ComValue, ComObjArray and ComValueRef (but not ComObject) by modifying the respective prototype object.
ja: ComValue型、ComObjArray型、ComValueRef型（ComObjectは除く）のオブジェクトは、それぞれのプロトタイプオブジェクトを変更することにより、プロパティとメソッドを定義することができます。

source: Properties and methods can be defined in the object itself or any of its base objects.
ja: プロパティとメソッドは、オブジェクト自身またはそのベース・オブジェクトのいずれかに定義することができます。

source: Properties are usually accessed by writing a dot followed by an identifier (just a name).
ja: プロパティは通常、ドットの後に識別子（単なる名前）を書いてアクセスする。

source: Properties: ClickCount, Default, Handle (replaces MenuGetHandle).
ja: プロパティー：ClickCount、Default、Handle（MenuGetHandleを置き換えたもの）。

source: Property and method definitions in classes utilize the same mechanism, so it is possible to define a property getter/setter and a method with the same name.
ja: クラスのプロパティ定義とメソッド定義は同じ仕組みを利用しているため、プロパティのゲッター/セッターとメソッドを同名で定義することが可能です。

source: Property names in typical use are preceded by ., which prevents the word from being interpreted as an operator.
ja: 一般的に使用されるプロパティ名の前には、演算子として解釈されることを防ぐために、.が付いています。

source: Prototype is automatically defined as an own property of any class object created by a class definition.
ja: プロトタイプは、クラス定義で作成されたクラスオブジェクトの自前プロパティとして自動的に定義されます。

source: Provides a horizontal scroll bar if appropriate for this type of control.
ja: このタイプのコントロールに適している場合、水平スクロールバーを提供します。

source: Provides a more precise control over the display time without having to use Sleep (which would stop the current thread).
ja: スリープ（現在のスレッドを停止させる）を使うことなく、表示時間をより正確にコントロールできる。

source: Provides a narrower title bar but the window will have no taskbar button.
ja: タイトルバーの幅が狭くなりますが、ウィンドウにタスクバーボタンが表示されなくなります。

source: Provides a string consisting of zero or more of the following letters to indicate the joystick's capabilities:
ja: ジョイスティックの能力を示す、以下の文字からなる文字列を0個以上用意します。

source: Provides a thin-line border around the control.
ja: コントロールの周囲に細い線のボーダーを提供します。

source: Provides a thin-line border around the window.
ja: ウィンドウの周囲に細い線のボーダーを提供します。

source: Provides a title bar and a thick window border/edge.
ja: タイトルバーと太いウィンドウのボーダー/エッジを提供します。

source: Provides a vertical scroll bar if appropriate for this type of control.
ja: このタイプのコントロールに適している場合、垂直スクロールバーを提供します。

source: Provides an interface for creating and managing windows, and creating controls.
ja: ウィンドウの作成と管理、コントロールの作成のためのインターフェイスを提供します。

source: Provides an interface for file input/output.
ja: ファイル入出力のためのインタフェースを提供します。

source: Provides an interface for modifying GUI controls and retrieving information about them.
ja: GUIコントロールを変更したり、コントロールに関する情報を取得するためのインターフェイスを提供します。
